package com.cay.rockstock.controller;

import com.google.common.collect.Lists;
import lombok.extern.slf4j.Slf4j;
import org.springframework.web.bind.annotation.GetMapping;
import org.springframework.web.bind.annotation.RestController;
import redis.clients.jedis.Jedis;

import javax.annotation.Resource;
import java.util.List;
import java.util.Random;


@Slf4j
@RestController
public class LoverController {
    @Resource
    private Jedis jedis;

    public static final String HTML_STYLE = "<!doctype html><html><head><meta charset=\"utf8\"></head><body><p style=\"text-align:center; color:red;\">{data}</p></body></html>";

    @GetMapping(value = "/love")
    public String queryLove() {
        jedis.incr("love_times");
        Random random = new Random();
        int r = random.nextInt(sentence.size());
        String love = sentence.get(r);
        log.info("这次说的情话：{}", love);
        return HTML_STYLE.replace("{data}", love);
    }

    @GetMapping(value = "/love_times")
    public String threeThousandTimes() {
        String times = jedis.get("love_times");
        log.info("说过了{}次", times);
        return times;
    }

    private final List<String> sentence = Lists.newArrayList(
            "我真的很花心，喜欢每一天的你和每一个的你",
            "岁月为笔，相思入墨，字里行间全是你",
            "不管将来发生什么事，你变成什么样子，你依然是我最爱的人",
            "不为日子皱眉头，答应你，只为吻你才低头",
            "屠呦呦和诺贝尔，人类和引力波，小李和奥斯卡，我和你",
            "最温柔的月光，也敌不过，你转瞬的回眸",
            "我贪得无厌，想要你的全部",
            "你是我喉咙里的刺，拔出来会痛，咽下去会死",
            "我希望你能明确你的身份，你是我的人",
            "希望你如锦绣山河。万人向往，却属于我",
            "时间最美的地方，就是让你我成为了我们",
            "其实，我一直都在你身后，就差你一个回头",
            "星辰满天，你是最闪烁的那颗",
            "你是我的今天，以及所有的明天",
            "明天生动而具体，有且仅有一个你",
            "每天早上醒来，看见你和阳光都在，这就是我想要的未来",
            "所谓风花雪月，就是我想跟你谈个恋爱",
            "你会爱自己就够了，那和爱我是一件事",
            "相遇是春风十里，原来是你；相爱是山长水阔，最后是你",
            "浪荡一生，钟情一人，微风十里，只想要你",
            "这是弓箭，这是火箭，你是我的甜蜜饯",
            "愿你迷路一生，还是走到我身旁",
            "我们拥有快乐星球，我们共享美好童话",
            "希望你下辈子不要改名，这样我会好找你一点",
            "如果世界不温柔，可以让我试试吗，让我做你的世界",
            "与你牵手走过微光，共赴繁花锦绣",
            "你来的话，日子会甜一点",
            "等待也是种信念，海的爱太深，时间太浅",
            "世事如书，我偏爱你这一句",
            "你总是有种魔力，让我可以无时无刻都为你着迷",
            "也就只有你能在我心里兴风作浪，也只有你让我甘愿上当",
            "我将牵着你的手走过生活的双行道，穿过茫茫人海，永不放手",
            "你才不是什么小人物，你在我这里是所有的天气和心情",
            "我常在海边，却不喜欢海，而是喜欢浪",
            "清晨的暖阳，浩瀚的夜空，过去的美好，余下的人生",
            "小哥哥，小哥哥，我给你一样东西好不好呀",
            "行行是你，不如一句，余生是你",
            "很高兴遇见你，在你我都鲜活的年纪",
            "时间会把错的人带走，把对的人带到你身边",
            "东风夜放花千树，我想去你家里住",
            "有什么不懂的，尽管吻我就可以了",
            "比喜欢多一点是心动，比心动多一点是爱，比爱多一点是你",
            "我就是喜欢你，喜欢得无可救药。服吗？不服你也喜欢我啊",
            "我想和你。从天光乍破。到暮雪白头",
            "我的猫很皮，可不可以帮我管它",
            "你是我今生渡不过的劫，多看一眼就心软，拥抱一下就沦陷",
            "我给你讲个故事，故事很长，我长话短说，“我想你了”",
            "你是百看不厌的书，我甘愿翻阅细读，字字珍贵，句句入心",
            "有缘的人终会相遇，相知，相伴，相遇最美",
            "?10。十里长街，走马一程，全都是你",
            "听闻姑娘治家有方，鄙人余生愿闻其详",
            "无论我多么平凡，但我总觉得我对你的爱很美",
            "我都舍不得欺负的人，哪能让别人欺负",
            "你是除月色和雪色外，向我走来的第三种绝色",
            "你怕孤独，没关系，从现在开始你有我陪着你",
            "如果老死在你怀里，那是多么幸福的事",
            "你的出现带给我希望，而我的希望是带给你幸福",
            "可爱不是长久之计，可爱我是长久之计",
            "我表白的方式一向简单粗暴，有时间一起睡觉",
            "宁为山水门前客，不做风花梦里人",
            "人生只要两次幸运便好，一次遇到你，一次走到底",
            "你不用多好，我喜欢就好",
            "请你当我手心里的宝",
            "我不需要那个人有多完美",
            "总想把世界上最好的都给你，却发现世界最好的就是你",
            "我喜欢你，就像月光喜欢着草地，只用温柔的目光拥抱你",
            "不要紧，你只是迟了一会儿吧",
            "拒绝了所有人的邀请，不愿与除你之外的人看风景",
            "你不要仗着我爱你，你就刻意为所欲为",
            "我执你之手，与你共白头",
            "总有一天，你，也会，喜欢我吧",
            "轻易说出“习惯了”是攒了有多久了的失望",
            "如果你是含泪的射手，我便是一只绝不再躲闪的白鸽",
            "如果可以，请给我一个回头，因为我一直在你的身后",
            "想和你喝酒是假的，想醉你怀里是真的",
            "我可能是盐吃多了，闲得总是想你",
            "和其他人都只是余生，只有和你才是未来",
            "遇到你，就好像中了毒，全身蔓延着爱你的毒素",
            "无论什么时候，我都会偏爱你",
            "因为爱你所以俯首称臣，而你却迟迟不赐我平身",
            "老婆，有你真好",
            "老婆，我爱你，还有我们的孩子",
            "老婆，现在给我打多少分呢？");

}



